app/views/planos/_form.html.erb

SELECT "exercicios".* FROM "exercicios"
---
            <%= label_tag('exercicio', nil, :class => "span2") %>
            <%= collection_select("exercicios_listbox", nil, Exercicio.all, :id, :nome, {}, {  :class => "span2 small-lborder" }) %>

SELECT "exercicios".* FROM "exercicios" INNER JOIN "exercicios_planos" ON "exercicios".id = "exercicios_planos".exercicio_id WHERE (("exercicios_planos".plano_id = 1))
---
     <div class="clearfix">
        <p><%= link_to_function "Associar exercicio", "adicionaExercicio(#{@plano.exercicios.to_json}, #{Exercicio.all.to_json})", :class => "btn primary"%></p>