app/views/planos/show.html.erb

  <b> Exercicios: </b><br />
  <% @plano.exercicios.each do |ex| %>
---
SELECT "exercicios".* FROM "exercicios" INNER JOIN "exercicios_planos" ON "exercicios".id = "exercicios_planos".exercicio_id WHERE (("exercicios_planos".plano_id = 1))