app/controllers/api/exercicios_controller.rb

SELECT "exercicios".* FROM "exercicios"
---
  def index
    respond_with Exercicio.all