app/views/notificacaos/index.html.erb

        <td class="span10"><%= link_to notificacao.titulo, notificacao %>
        <td>por <%= link_to User.find(notificacao.admin_id).nome, user_path(notificacao.admin_id) %> em <%= notificacao.data %></td>
---
SELECT "admins".* FROM "admins" WHERE "admins"."user_id" = 941520943 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 941520943]]