app/views/aulas/_form.html.erb

<script type="text/javascript">
  $(document).ready(function() {

    jQuery.validator.addMethod("exactLength", function(value, element, param) {
      return this.optional(element) || value.length == param;
    }, jQuery.format("Please enter exactly {0} characters."));

    jQuery.validator.addMethod("hourFormat", function(value, element, param) {
      if (this.optional(element))
        return true;

      var re = /^([01]?\d|2[0-3]):([0-5]\d)$/;
      return re.test(value) == param;
    }, "Enter the correct time.");

    $("#form_aula").validate( {
      rules: {
        "aula[inicio]": {
          required: true,
          hourFormat: true
        },
        "aula[duracao]": {
---
SELECT "tipo_aulas".* FROM "tipo_aulas"

    <div class="input">
      <%= collection_select("aula", "staff_id", User.joins(:staffs).where(:ginasio_id => @ginasio.id), :id, :nome, {}, { :class => "span6 no-resize" }) %>
---
SELECT "users".* FROM "users" INNER JOIN "staffs" ON "staffs"."user_id" = "users"."id" WHERE "users"."ginasio_id" = 819479167

    <div class="input">
      <%= collection_select("aula", "estudio_id", Estudio.where(:ginasio_id => @ginasio.id), :id, :nome, {}, { :class => "span4 no-resize" }) %>
---
SELECT "estudios".* FROM "estudios" WHERE "estudios"."ginasio_id" = 819479167