app/views/aulas/index.html.erb

            <% if Date.today.wday-1 == aula.dia %>
              <td><%= link_to TipoAula.find(aula.tipo_aula_id).tipo, ginasio_aula_reserva_aulas_path(params[:ginasio_id],aula.id)%> </td>
---
SELECT "aulas".* FROM "aulas" WHERE "aulas"."ginasio_id" = 819479167

            <td><%= aula.duracao %> minutos</td>
            <td><%= User.find(aula.staff_id).nome %></td>
---
SELECT "staffs".* FROM "staffs" WHERE "staffs"."user_id" = 207754824 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 207754824]]