app/views/users/_form.html.erb

    <div class="input">
      <%= collection_select("user", "ginasio_id", Ginasio.all, :id, :nome, {}, {  :class => "span6 no-resize" }) %>
---
SELECT "ginasios".* FROM "ginasios"

      <div class="input">
        <%= collection_select("user", "modalidade_pagamento_id", ModalidadePagamento.all, :id, :nome, {}, {  :class => "span6 no-resize" }) %>
---
SELECT "modalidade_pagamentos".* FROM "modalidade_pagamentos"