app/views/users/show_planos.html.erb

<% if current_user && @user.planos.count > 0 %>
---
SELECT "planos".* FROM "planos" WHERE ("planos".user_id = 2)
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "planos" WHERE ("planos".user_id = 2)) AS subquery