app/views/ginasios/index.html.erb

SELECT "cidades".* FROM "cidades"
---
    <div class="input">
      <%= collection_select("", "cidade", Cidade.all, :id, :nome, {}, {  :class => "span3 no-resize" }) %>