app/views/ginasios/show.html.erb

SELECT "tipo_aulas".* FROM "tipo_aulas"
---
        <%= link_to 'Editar Dados', edit_ginasio_path(@ginasio), :class => "btn success" %>
        <%= link_to 'Ver Estatisticas', ginasio_estatisticas_path(@ginasio, :taid => TipoAula.all.first.id, :mes => Date.today.month, :ano => Date.today.year), :class => "btn success" %>