app/controllers/aulas_controller.rb

SELECT "ginasios".* FROM "ginasios" WHERE "ginasios"."id" = ? LIMIT 1  [["id", "819479167"]]
SELECT "aulas".* FROM "aulas" WHERE "aulas"."ginasio_id" = 819479167
---
  def index
    @aulas = Aula.where(:ginasio_id => params[:ginasio_id]).order('inicio')
    @ginasio = Ginasio.find(params[:ginasio_id])

    @aulas_sorted = Aula.where(:ginasio_id => params[:ginasio_id]).group_by(&:dia)

SELECT "ginasios".* FROM "ginasios" WHERE "ginasios"."id" = ? LIMIT 1  [["id", "819479167"]]
---
  def new
    @aula = Aula.new
    @ginasio = Ginasio.find(params[:ginasio_id])