app/controllers/estudios_controller.rb

  def index
    @estudios = Estudio.where(:ginasio_id => params[:ginasio_id])
    @ginasio = Ginasio.find(params[:ginasio_id])
---
SELECT "estudios".* FROM "estudios" WHERE "estudios"."ginasio_id" = 240923823 ORDER BY nome ASC
SELECT "ginasios".* FROM "ginasios" WHERE "ginasios"."id" = ? LIMIT 1  [["id", "240923823"]]

  def show
    @estudio = Estudio.find(params[:id])
---
SELECT "estudios".* FROM "estudios" WHERE "estudios"."id" = ? LIMIT 1  [["id", "335579846"]]