app/controllers/estudios_controller.rb

SELECT "ginasios".* FROM "ginasios" WHERE "ginasios"."id" = ? LIMIT 1  [["id", "240923823"]]
---
  def show
    @ginasio = Ginasio.find(params[:ginasio_id])