app/controllers/exercicios_controller.rb

  def index
    @exercicios = Exercicio.all
---
SELECT "exercicios".* FROM "exercicios"

  def show
    @exercicio = Exercicio.find(params[:id])
---
SELECT "exercicios".* FROM "exercicios" WHERE ("exercicios"."id" = 1) LIMIT 1

  def edit
    @exercicio = Exercicio.find(params[:id])
---
SELECT "exercicios".* FROM "exercicios" WHERE ("exercicios"."id" = 1) LIMIT 1

  def create
    @exercicio = Exercicio.new(params[:exercicio])

    respond_to do |format|
      if @exercicio.save
---
INSERT INTO "exercicios" ("created_at", "maquina", "nome", "tipo", "updated_at") VALUES ('2011-10-24 16:46:56.685891', 'E tal', 'Coiso', NULL, '2011-10-24 16:46:56.685891')

  def update
    @exercicio = Exercicio.find(params[:id])

    respond_to do |format|
      if @exercicio.update_attributes(params[:exercicio])
---
SELECT "exercicios".* FROM "exercicios" WHERE ("exercicios"."id" = 1) LIMIT 1
UPDATE "exercicios" SET "tipo" = 'musculacao', "updated_at" = '2011-10-24 16:52:55.651904' WHERE ("exercicios"."id" = 1)

  def destroy
    @exercicio = Exercicio.find(params[:id])
    @exercicio.destroy
---
SELECT "exercicios".* FROM "exercicios" WHERE ("exercicios"."id" = 2) LIMIT 1
DELETE FROM "exercicios" WHERE ("exercicios"."id" = 2)