app/controllers/ginasios_controller.rb

  def index
    @ginasios = Ginasio.all
---
SELECT "ginasios".* FROM "ginasios"

  def pertocidade

    @cidade = Cidade.find_by_nome(params[:cidade])
---
SELECT "cidades".* FROM "cidades" WHERE "cidades"."nome" = 'Porto' LIMIT 1

  def show
    @ginasio = Ginasio.find(params[:id])
---
SELECT "ginasios".* FROM "ginasios" WHERE "ginasios"."id" = ? LIMIT 1  [["id", "2764946"]]