app/controllers/modalidade_pagamentos_controller.rb

  def index
    @modalidade_pagamentos = ModalidadePagamento.all
---
SELECT "modalidade_pagamentos".* FROM "modalidade_pagamentos"

  def show
    @modalidade_pagamento = ModalidadePagamento.find(params[:id])
---
SELECT "modalidade_pagamentos".* FROM "modalidade_pagamentos" WHERE "modalidade_pagamentos"."id" = ? LIMIT 1  [["id", "13059191"]]