app/controllers/notificacaos_controller.rb

SELECT "notificacaos".* FROM "notificacaos"
---
  def index
    @notificacaos = Notificacao.all