app/controllers/pagamentos_controller.rb

SELECT "pagamentos".* FROM "pagamentos" WHERE "pagamentos"."mes" = 12 AND "pagamentos"."ano" = 2011
---
  def index

    if params[:user_id] && params[:ano]

      Pagamento.update_mensal
      @pagamentos = Pagamento.where(:ano => params[:ano], :user_id => params[:user_id])

    elsif params[:mes] && params[:ano]

      Pagamento.update_mensal
      @pagamentos = Pagamento.where(:ano => params[:ano], :mes => params[:mes])