app/controllers/pedido_planos_controller.rb

SELECT "pedido_planos".* FROM "pedido_planos"
---
  def index

    @pedidos = PedidoPlano.all