app/controllers/planos_controller.rb

  def index
    if(params[:user_id])
      @planos = Plano.where(:user_id => params[:user_id]).order('data DESC')
      @user = User.find(params[:user_id])
    else
      @planos = Plano.all
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "planos".* FROM "planos"

  def show
    @user = current_user
    @plano = Plano.find(params[:id])
---
SELECT "planos".* FROM "planos" WHERE ("planos"."id" = 1) LIMIT 1

  def new
    @plano = Plano.new(:user_id => params[:user_id], :data => Date.today)
    @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 2) LIMIT 1

  def edit
    @plano = Plano.find(params[:id])
    @user = User.find(@plano.user_id)
---
SELECT "planos".* FROM "planos" WHERE ("planos"."id" = 2) LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" = 2) LIMIT 1

  def create
    @exercicios = params[:selected_exercicios].split(",")
    params[:plano][:data] = Date.today
    @plano = Plano.new(params[:plano])
    @user = User.find(@plano.user_id)


    respond_to do |format|
      if @plano.save
        format.html { redirect_to(user_planos_path(@user), :flash => { :success => "Plano de treinos criado com sucesso!" }) }
        format.xml  { render :xml => @plano, :status => :created, :location => @plano }
      else
        format.html { render :action => "new" }
        format.xml  { render :xml => @plano.errors, :status => :unprocessable_entity }
      end
    end

    @exercicios.each do |ex|
	    @ex_splited = ex.split("|")
	    ExerciciosPlanos.create(:plano_id => @plano.id, :exercicio_id => @ex_splited[0], :peso => @ex_splited[1], :series => @ex_splited[2], :repeticoes => @ex_splited[3]);
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
INSERT INTO "planos" ("admin_id", "altura", "created_at", "data", "peso", "updated_at", "user_id") VALUES (NULL, 185, '2011-11-01 17:58:46.714612', '2011-10-22', 80, '2011-11-01 17:58:46.714612', NULL)
INSERT INTO "exercicios_planos" ("created_at", "exercicio_id", "peso", "plano_id", "repeticoes", "series", "updated_at") VALUES ('2011-10-26 18:32:49.859290', 1, NULL, NULL, NULL, NULL, '2011-10-26 18:32:49.859290')

  def update
    @plano = Plano.find(params[:id])
    @exercicios = params[:selected_exercicios].split(",")
    @user = User.find(@plano.user_id)

    @exercicios.each do |ex|
      @ex_splited = ex.split("|")
	    ExerciciosPlanos.create(:plano_id => @plano.id, :exercicio_id => @ex_splited[0], :peso => @ex_splited[1], :series => @ex_splited[2], :repeticoes => @ex_splited[3]);
    end

    respond_to do |format|
      if @plano.update_attributes(params[:plano])
---
SELECT "planos".* FROM "planos" WHERE ("planos"."id" = 2) LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
INSERT INTO "exercicios_planos" ("created_at", "exercicio_id", "peso", "plano_id", "repeticoes", "series", "updated_at") VALUES ('2011-10-26 11:28:20.733191', 3, NULL, 1, NULL, NULL, '2011-10-26 11:28:20.733191')
UPDATE "planos" SET "data" = '2011-10-22', "updated_at" = '2011-11-01 17:36:31.190958' WHERE ("planos"."id" = 1)

  def destroy
    @plano = Plano.find(params[:id])
    @user = User.find(@plano.user_id)
    @plano.destroy
---
SELECT "planos".* FROM "planos" WHERE ("planos"."id" = 5) LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" = 2) LIMIT 1
DELETE FROM "planos" WHERE ("planos"."id" = 5)