app/controllers/tipo_aulas_controller.rb

  def index
    @tipo_aulas = TipoAula.all
---
SELECT "tipo_aulas".* FROM "tipo_aulas"

  def show
    @tipo_aula = TipoAula.find(params[:id])
---
SELECT "tipo_aulas".* FROM "tipo_aulas" WHERE "tipo_aulas"."id" = ? LIMIT 1  [["id", "14375806"]]