app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "datanascimento", "email", "morada", "nome", "password_hash", "password_salt", "telefone", "updated_at") VALUES ('2011-11-01 12:50:07.564457', '1989-04-28', 'machado.pedro@fe.up.pt', 'Rua Jorge Sena , 101 - 1º Direito', 'Pedro Machado', '$2a$10$Yl9nKuMgdlyPdelez0k4y.PlaLca4ctx1mascdnaAFhLjC9Lldxtq', '$2a$10$Yl9nKuMgdlyPdelez0k4y.', '918480627', '2011-11-01 12:50:07.564457')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT "planos".* FROM "planos" WHERE ("planos"."id" = 2) LIMIT 1
---
  def show_planos
    @plano = Plano.find(params[:id])

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
INSERT INTO "staffs" ("created_at", "updated_at", "user_id") VALUES ('2011-11-02 20:55:53.454852', '2011-11-02 20:55:53.454852', 2)
INSERT INTO "admins" ("created_at", "updated_at", "user_id") VALUES ('2011-11-02 20:56:47.967459', '2011-11-02 20:56:47.967459', 2)
DELETE FROM "staffs" WHERE ("staffs"."id" = 26)
SELECT "admins".* FROM "admins" WHERE ("admins"."user_id" = 1) LIMIT 1
SELECT "staffs".* FROM "staffs" WHERE ("staffs"."user_id" = 2) LIMIT 1
---
  def promote
    @user = User.find(params[:id])

    if @user.normal?
      Staff.create(:user_id => @user.id)
      redirect_to @user, :notice => "User promoted to staff"
    elsif @user.staff?
      Admin.create(:user_id => @user.id)
      Staff.find_by_user_id(@user.id).destroy

SELECT "users".* FROM "users" WHERE ("users"."id" = 2) LIMIT 1
INSERT INTO "staffs" ("created_at", "updated_at", "user_id") VALUES ('2011-11-02 21:01:54.328166', '2011-11-02 21:01:54.328166', 2)
DELETE FROM "admins" WHERE ("admins"."id" = 80)
DELETE FROM "staffs" WHERE ("staffs"."id" = 27)
SELECT "admins".* FROM "admins" WHERE ("admins"."user_id" = 1) LIMIT 1
SELECT "staffs".* FROM "staffs" WHERE ("staffs"."user_id" = 2) LIMIT 1
---
  def demote
    @user = User.find(params[:id])

    if @user.admin?
      Staff.create(:user_id => @user.id)
      Admin.find_by_user_id(@user.id).destroy