app/controllers/users_controller.rb

  def index
    if params[:ginasio_id]
      @users = User.where(:ginasio_id => params[:ginasio_id])
    else
      @users = User.find(:all, :order => 'id')
---
SELECT "users".* FROM "users" WHERE "users"."ginasio_id" = 240923823
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 941520943]]