app/views/estatisticas/index.html.erb

SELECT "tipo_aulas".* FROM "tipo_aulas"
---

  <%= collection_select("", "taid", TipoAula.all, :id, :tipo, {}, {  :class => "span6 no-resize" }) %>